a5021/stm32-async-1wire/port/stm32f4/ow_port_f4.h
/**
 * @brief Merge the direction-bit write with the id/cmp read pair in one pass
 * @param[in] bit Direction bit to write in slot 1 (0 or 1)
 * @param[in] pulse3 Buffer for the three captured slots (write-slot capture,
 *                   id pulse, cmp pulse)
 * @param[in] read_pulse CCR3 reloads for read slots 2-3 (+ trailing 0)
 * @note Single timer pass (RCR=2, three slots) with two DMA2 streams armed
 *       together. The CC2 slot-end marker (Stream2; CCR2 = ONE+ZERO, frozen
 *       output) reloads CCR3 from read_pulse —
 *       ONEWIRE_ONE_PULSE for slots 2-3, then 0 during slot 3 so the one-pulse
 *       timer stops with the line released to idle HIGH — while CC4 (Stream4)
 *       captures the write-slot pulse plus the id/cmp pair into pulse3[0..2].
 *       OC3PE is off so the reload is immediate. DMA requests stay disconnected
 *       (DIER=UIE only) through the re-arm kick so a stale CC2 request can
 *       never fire the reload early; they are re-connected right before CEN
 *       with the direction pulse re-armed last.
 */
__STATIC_FORCEINLINE void ow_port_write_then_read(uint8_t bit, volatile uint16_t* pulse3,
                                                  const ow_pulse_t* read_pulse) {
#if OW_DRIVE_ACTIVE
    ow_port_set_pin_mode(0); /* merged write+read stays open-drain so the read half is safe */
#endif
    const ow_pulse_t write_pulse = bit ? ONEWIRE_ONE_PULSE : ONEWIRE_ZERO_PULSE;
    ow_port_marker_toggle(); /* LA marker: rising edge = merged pass starts here */
    /* Clean re-arm of both streams: clear all flags. */
    ow_port_dma_rearm(DMA2_Stream2, &DMA2->LIFCR,
                      DMA_LIFCR_CTCIF2 | DMA_LIFCR_CHTIF2 | DMA_LIFCR_CTEIF2 |
                          DMA_LIFCR_CDMEIF2 | DMA_LIFCR_CFEIF2);
    ow_port_dma_rearm(DMA2_Stream4, &DMA2->HIFCR,
                      DMA_HIFCR_CTCIF4 | DMA_HIFCR_CHTIF4 | DMA_HIFCR_CTEIF4 |
                          DMA_HIFCR_CDMEIF4 | DMA_HIFCR_CFEIF4);
    /* Arrange the timer pass: three slots, then a single update event. CC4 is
     * armed for the whole pass, so the write-slot falling edge is captured
     * into pulse3[0] as well as the id/cmp reads into [1] and [2]. */
    T1.RCR = 2;
    T1.ARR = ONEWIRE_ONE_PULSE + ONEWIRE_ZERO_PULSE + ONEWIRE_GUARD_BAND; /* Total bit slot time */
    T1.CCR2 = ONEWIRE_ONE_PULSE + ONEWIRE_ZERO_PULSE; /* End-of-slot reload trigger */
    /* OC3 in PWM mode (no preload so the DMA reload is immediate), CC4 capture armed */
    T1.CCMR2 = TIM_CCMR2(OC3M_0, OC3M_1, OC3M_2, CC4S_1, OW_PORT_IC4F_ARGS);
    T1.CCER = TIM_CCER(CC3E, CC4E);
    /* Keep the DMA requests disconnected while the channels re-arm. */
#if OW_PORT_LOW_POWER
    T1.DIER = TIM_DIER(UIE); /* keep UIE for WFE while the DMA requests are apart */
#else
    T1.DIER = 0;
#endif
    /* Capture stream: write-slot capture plus the id/cmp pulse pair. */
    OW_PORT_DMA_CAPTURE.PAR = (uint32_t)&T1.CCR4;
    OW_PORT_DMA_CAPTURE.M0AR = (uint32_t)pulse3;
    OW_PORT_DMA_CAPTURE.NDTR = 3;
    OW_PORT_DMA_CAPTURE.CR = OW_PORT_DMA_CR_CAPTURE | OW_PORT_DMA_CHSEL |
                             DMA_SxCR_MSIZE_0 | DMA_SxCR_EN;
    /* Feed stream: halfword-width reloads of CCR3 — read pulse for slots 2-3,
     * then the trailing 0 during slot 3 so the OPM stop hands the line back
     * idle HIGH (hardware bus release); fed zero-copy from read_pulse. */
    OW_PORT_DMA_FEED.PAR = (uint32_t)&T1.CCR3;
    OW_PORT_DMA_FEED.M0AR = (uint32_t)read_pulse;
    OW_PORT_DMA_FEED.NDTR = 3;
    OW_PORT_DMA_FEED.CR = OW_PORT_DMA_CR_FEED | OW_PORT_DMA_CHSEL |
                          DMA_SxCR_MSIZE_0 | DMA_SxCR_EN;
    /* UG kick: reload ARR/RCR preloads and hand the fresh operation a clean
     * UIF, then re-connect the DMA requests and start. The direction pulse is
     * re-armed after the DIER write so a stale CC2 request can never clobber
     * it before the timer runs. */
    ow_port_update_event();
#if OW_PORT_LOW_POWER
    T1.DIER = TIM_DIER(CC4DE, CC2DE, UIE); /* Capture + CCR3 reload via DMA (UIE for WFE) */
#else
    T1.DIER = TIM_DIER(CC4DE, CC2DE); /* Capture + CCR3 reload via DMA */
#endif
    T1.CCR3 = write_pulse; /* Re-arm the direction pulse (safe against a stale CC2 DMA reload) */
    T1.CR1 = TIM_CR1(OPM, CEN);
}

/**
 * @brief Schedule a read of `bytes` bytes from the bus
 * @param[out] dst Buffer for the captured pulse durations (bytes x 8 x 8-bit)
 * @param[in] bytes Number of bytes to read, 1..ONEWIRE_MAX_READ_BYTES (32).
 * @return 1 if the read was scheduled, 0 if `bytes` is out of range. In debug
 *         builds the reject path also traps with an assert.
 */
__STATIC_FORCEINLINE uint8_t ow_port_read_data(volatile uint8_t* dst, uint8_t bytes) {
    if (bytes == 0u || bytes > ONEWIRE_MAX_READ_BYTES) {
        assert(0 && "ow_port_read_data: bytes out of range");
        return 0;
    }
    const uint16_t bits = (uint16_t)bytes * ONEWIRE_BITS_PER_BYTE;
    T1.RCR = bits - 1;
    T1.ARR = ONEWIRE_ONE_PULSE + ONEWIRE_ZERO_PULSE + ONEWIRE_GUARD_BAND;
    T1.CCR3 = ONEWIRE_ONE_PULSE;
    ow_port_capture(dst, bits, 8);
    return 1u;
}

/**
 * @brief Engage or release the parasite-power strong pull-up on the bus
 * @param[in] on 1 drives the bus line HIGH actively, 0 releases it again
 * @note The pin stays in alternate-function mode (TIM1_CH3) at all times.
 *       Engaged: OTYPER.OT10 is cleared (alternate-function push-pull) so the
 *       AF output stage drives the line HIGH actively, sourcing the current
 *       parasite devices need during temperature conversion and EEPROM
 *       programming windows.  Released: OT10 is set again (AF open-drain), the
 *       AF output goes inactive (PWM mode 2 with the counter stopped at zero)
 *       so the pin floats HIGH via the external pull-up.  No BSRR or MODER
 *       writes needed: the timer is stopped (OPM) during the window, the
 *       output is inactive, and ODR is irrelevant in AF mode.
 */
__STATIC_FORCEINLINE void ow_port_strong_pullup(uint8_t on) {
    ow_port_set_pin_mode(on);
}

#endif /* OW_PORT_F4_H */